package multithread.lesson2;

/**
 * Concurrency означает выполнение сразу нескольких задач. В зависимости от процессора компьютера concurrency может
 * достигаться разными способами.
 *
 * Parallelism означает выполнение 2-х и более задач в одно и то же время, т.е. параллельно. В компьютерах с многоядерным
 * процессором concurrency может достигаться за счёт parallelism.
 *
 *
 * В синхронном программировании задачи выполняются последовательно друг за другом.
 *
 * В асинхронном программировании каждая следующая задача НЕ ждёт окончания выполнения предыдущей. Асинхронное
 * программирование помогает достичь concurrency.
 */
